Revit 2024 API
StructuralAsset.Copy Method
 Produces a copy of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public StructuralAsset Copy()
Visual Basic
Public Function Copy As StructuralAsset
Visual C++
public:
StructuralAsset^ Copy()
Return Value
 A copy of the asset.
See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace